# Названия колонок для данных NGT.
# Переводит оригинальные названия в стандартизированные имена для работы с данными
dict_ngt_column = {
    '№ скважины': 'wellName',
    'Дата': 'nameDate',
    'Характер работы': 'workMarker',
    'Состояние': 'wellStatus',
    'Месторождение': 'oilfield',
    'Объекты работы': 'workHorizon',
    'Куст': 'wellCluster',
    'Координата X': 'coordinateXT1',
    'Координата Y': 'coordinateYT1',
    'Координата забоя Х (по траектории)': 'coordinateXT3',
    'Координата забоя Y (по траектории)': 'coordinateYT3',
    'Дебит нефти (ТР), т/сут': 'oilRate',
    'Дебит жидкости (ТР), м3/сут': 'fluidRate',
    'Приемистость (ТР), м3/сут': 'injectivity',
    'Обводненность (ТР), % (объём)': 'water_cut',
    'Способ эксплуатации': 'exploitation',
    'Дебит природного газа, тыс.м3/сут': 'gasRate',
    'Приемистость (по суточным), м3/сут': 'injectivity_day',
    'Дебит конденсата газа, т/сут': 'condRate',
    # 'Количество исследований за год': 'num_of_research'
}

# Названия колонок для данных GeoBD.
# Переводит столбцы GeoBD в стандартизированные имена
dict_geobd_columns = {
    'NSKV': 'wellName',
    'STATUS_DATE': 'nameDate',
    'FOND': 'workMarker',
    'SOST': 'wellStatus',
    'MEST': 'oilfield',
    'PLAST': 'workHorizon',
    'KUST': 'wellCluster',
    'SIMVOL': 'marker_num',
    'X': 'coordinateX',
    'X3': 'coordinateX3',
    'Y': 'coordinateY',
    'Y3': 'coordinateY3',
    'DEBOIL': 'oilRate',
    'DEBLIQ': 'fluidRate',
    'DEBGAS': 'gasRate',
    'PRIEM': 'injectivity',
    'PRIEMGAS': 'injectivity_day',
    'VPROCOBV': 'water_cut',
    'SPOSOB': 'exploitation',
    'DEBCOND': 'condRate',
    'well type': 'well type',
    # 'RESEARCH': 'num_of_research'
}

# Названия колонок для проектных данных.
# Используется для получения данных из проектных файлов
dict_project_columns = {
    'NSKV': 'wellName',
    'X': 'coordinateX',
    'X3': 'coordinateX3',
    'Y': 'coordinateY',
    'Y3': 'coordinateY3',
    'PLAST': 'workHorizon',
    'well type': 'well type'
}

# Константы, используемые для фильтрации статусов скважин.
# Используются при обработке данных для отбора нужных типов скважин
dict_constant = {
    'PROD_STATUS': "раб|нак|ост",      # Статусы продуктивных скважин (например, рабочие, накопительные)
    'PROD_MARKER': "неф|газ|гк|конд",  # Маркеры для продуктивных скважин (нефть, газ, конденсат)
    'PIEZ_STATUS': "пьез",             # Статус пьезометрических скважин
    'INJ_MARKER': "наг|пог",           # Маркеры для нагнетательных скважин
    'INJ_STATUS': "раб",               # Статус нагнетательных скважин
    'DELETE_STATUS': "лик|конс|перев|б/д|осв|безд|ост|проек"  # Статусы скважин, которые нужно исключить
}

# Словарь для однозначного определения значка скважины в выгрузке NGT
dict_ngt_encoding = {
    "неф": {"пьез": {"эцн": 115,
                     "шгн": 115,
                     "фон": 115,
                     "0": 115},
            "лик": {"эцн": 127,
                    "шгн": 127,
                    "фон": 127,
                    "0": 127},
            "конс": {"эцн": 124,
                     "шгн": 124,
                     "фон": 124,
                     "0": 124},
            "ост.": {"эцн": 85,
                     "шгн": 79,
                     "фон": 73,
                     "0": 73},
            "б/д тг": {"эцн": 86,
                       "шгн": 80,
                       "фон": 74,
                       "0": 74},
            "б/д пр л": {"эцн": 86,
                         "шгн": 80,
                         "фон": 74,
                         "0": 74},
            "раб.": {"эцн": 84,
                     "шгн": 78,
                     "фон": 72,
                     "0": 72},
            "осв тг": {"эцн": 84,
                       "шгн": 78,
                       "фон": 72,
                       "0": 72},
            "осв пр": {"эцн": 84,
                       "шгн": 78,
                       "фон": 72,
                       "0": 72},
            "0": {"эцн": 86,
                  "шгн": 80,
                  "фон": 74,
                  "0": 74}},
    "наг": {"пьез": 215,
            "лик": 147,
            "раб.": 102,
            "ост.": 103,
            "конс": 148,
            "б/д тг": 104,
            "б/д пр л": 104,
            "0": 104},
    "газ": {"раб.": 200,
            "ост.": 201,
            "лик": 205,
            "б/д пр л": 202,
            "б/д тг": 202,
            "конс": 204,
            "осв тг": 203,
            "осв пр": 203,
            "0": 202},
    "переведена на другой объект": {"раб.": {"0": 117},
                                    "пьез": {"0": 117},
                                    "ост.": {"0": 117},
                                    "лик": {"0": 117},
                                    "б/д пр л": {"0": 117},
                                    "б/д тг": {"0": 117},
                                    "конс": {"0": 117},
                                    "осв тг": {"0": 117},
                                    "осв пр": {"0": 117},
                                    "0": {"0": 117}},
    "вдз": {"раб.": 271,
            "ост.": 272,
            "лик": 273,
            "б/д пр л": 273,
            "б/д тг": 273,
            "конс": 273,
            "осв тг": 272,
            "осв пр": 272,
            "0": 273},
    "0": {"раб.": 117,
          "ост.": 117,
          "лик": 117,
          "б/д пр л": 117,
          "б/д тг": 117,
          "конс": 117,
          "осв тг": 117,
          "осв пр": 117,
          "0": 117}
}
